# Pandas
Same as excel Spreadsheet
One individual column is series
Dataframe is like excel spreadsheet

In [64]:
import pandas as pd
import numpy as np

In [65]:
mylist=[5.4,6.1,1.7,99.8]
myarray=np.array(mylist)

In [66]:
#convert list and np array in series
myseries1=pd.Series(data=mylist)
print(myseries1)
myseries2=pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [67]:
#print own individual items 
print(myseries1[2])

1.7

In [68]:
# we can add labels to the entries in the series 
mylabels=['first','second','third','fourth']
myseries3 = pd.Series(data=mylist, index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [69]:
# we need not be explicity about entries of pd.Series
myseries4 = pd.Series(mylist, mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [70]:
#access enties at a particular index location
print(myseries4['second'])

6.1

In [71]:
myseries5=pd.Series([5.5,1.1,1.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    1.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    101.6
second      NaN
third       2.8
dtype: float64

In [72]:
#concatenate two series

In [73]:
df1=pd.concat([myseries4,myseries5],axis=1,sort=False) # axis 0 is row concat, 1 column concat
df1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  1.8
fifth    NaN  1.6

In [74]:
df1=pd.concat([myseries4,myseries5],axis=0,sort=False) # axis 0 is row concat, 1 column concat
df1

first      5.4
second     6.1
third      1.7
fourth    99.8
first      5.5
third      1.1
fourth     1.8
fifth      1.6
dtype: float64

In [75]:
#create a new dataframe
df2=pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  1.314234  0.631615 -1.830098 -0.702905  1.139570
1  0.574806  0.915591 -1.632810  0.254145 -0.888893
2  0.149627 -1.034096 -0.679534 -0.612464  0.183149
3 -0.675706 -0.419511  2.433317 -0.542463  0.806863
4 -1.122266  0.169323 -0.180751  0.829617 -0.434550

In [76]:
df3=pd.DataFrame(np.random.randn(5,5),index=['1st row','2nd row','3rd row','4th row','5th row'], 
                 columns=['1st col','2nd col','3rd col','4th col','5th col'])
df3

          1st col   2nd col   3rd col   4th col   5th col
1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173
2nd row -0.543819  0.419726 -0.072163  1.130083 -0.044815
3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023
4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871
5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640

In [77]:
#in Pandas the first value alone in column and not rows
print(df3['2nd col'])

1st row   -2.244255
2nd row    0.419726
3rd row    0.301205
4th row    0.612709
5th row   -1.887275
Name: 2nd col, dtype: float64

In [78]:
print(df3[['2nd col','3rd col']])

          2nd col   3rd col
1st row -2.244255  1.483233
2nd row  0.419726 -0.072163
3rd row  0.301205 -1.003290
4th row  0.612709  0.546187
5th row -1.887275 -1.412238

In [79]:
#loc for accessing the rows in the dataframe
print(df3.loc['2nd row'])

1st col   -0.543819
2nd col    0.419726
3rd col   -0.072163
4th col    1.130083
5th col   -0.044815
Name: 2nd row, dtype: float64

In [80]:
#iloc index location , even though re-labeled it exist
print(df3.iloc[2])

1st col    0.447293
2nd col    0.301205
3rd col   -1.003290
4th col   -0.241587
5th col    1.355023
Name: 3rd row, dtype: float64

In [81]:
df3.loc[['4th row','1st row'],['2nd col','3rd col']]

          2nd col   3rd col
4th row  0.612709  0.546187
1st row -2.244255  1.483233

In [82]:
#logical indexing
df3>0

         1st col  2nd col  3rd col  4th col  5th col
1st row     True    False     True    False     True
2nd row    False     True    False     True    False
3rd row     True     True    False    False     True
4th row    False     True     True    False    False
5th row     True    False    False    False     True

In [83]:
print(df3[df3>0])

          1st col   2nd col   3rd col   4th col   5th col
1st row  0.006736       NaN  1.483233       NaN  0.484173
2nd row       NaN  0.419726       NaN  1.130083       NaN
3rd row  0.447293  0.301205       NaN       NaN  1.355023
4th row       NaN  0.612709  0.546187       NaN       NaN
5th row  0.421636       NaN       NaN       NaN  1.305640

In [84]:
df3['6th col']=np.random.randn(5,1)

In [85]:
df3

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
2nd row -0.543819  0.419726 -0.072163  1.130083 -0.044815  0.870454
3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [86]:
#drop column from dataframe
df3.drop('1st col',axis=1)

          2nd col   3rd col   4th col   5th col   6th col
1st row -2.244255  1.483233 -1.389581  0.484173  0.493280
2nd row  0.419726 -0.072163  1.130083 -0.044815  0.870454
3rd row  0.301205 -1.003290 -0.241587  1.355023 -0.761517
4th row  0.612709  0.546187 -0.517375 -1.223871  0.648123
5th row -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [87]:
df3

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
2nd row -0.543819  0.419726 -0.072163  1.130083 -0.044815  0.870454
3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [88]:
df4=df3.drop('1st col',axis=1)
df4

          2nd col   3rd col   4th col   5th col   6th col
1st row -2.244255  1.483233 -1.389581  0.484173  0.493280
2nd row  0.419726 -0.072163  1.130083 -0.044815  0.870454
3rd row  0.301205 -1.003290 -0.241587  1.355023 -0.761517
4th row  0.612709  0.546187 -0.517375 -1.223871  0.648123
5th row -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [89]:
#drop the row axis=0
df5=df3.drop('2nd row',axis=0)
df5

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [90]:
#remove index tables
df5.reset_index()

     index   1st col   2nd col   3rd col   4th col   5th col   6th col
0  1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
1  3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
2  4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
3  5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [91]:
df5

          1st col   2nd col   3rd col   4th col   5th col   6th col
1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [92]:
df5.reset_index(inplace=True)
df5

     index   1st col   2nd col   3rd col   4th col   5th col   6th col
0  1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
1  3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
2  4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
3  5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

In [93]:
df5['new name']=['this','is','the','row']

In [94]:
df5

,index,1st col,2nd col,3rd col,4th col,5th col,6th col,new name
0,1st row,0.006736,-2.244255,1.483233,-1.389581,0.484173,0.493280,this
1,3rd row,0.447293,0.301205,-1.003290,-0.241587,1.355023,-0.761517,is
2,4th row,-2.120976,0.612709,0.546187,-0.517375,-1.223871,0.648123,the
3,5th row,0.421636,-1.887275,-1.412238,-1.571662,1.305640,0.318890,row

In [95]:
df5.set_index('new name',inplace=True)

In [96]:
df5

            index   1st col   2nd col   3rd col   4th col   5th col   6th col
new name
this      1st row  0.006736 -2.244255  1.483233 -1.389581  0.484173  0.493280
is        3rd row  0.447293  0.301205 -1.003290 -0.241587  1.355023 -0.761517
the       4th row -2.120976  0.612709  0.546187 -0.517375 -1.223871  0.648123
row       5th row  0.421636 -1.887275 -1.412238 -1.571662  1.305640  0.318890

# Combining Dataframes 
The ways dataframes are combines in pandas is similar to SQL
We have 3 methods of combining dataframes
1. Concat
2. join
3. merge

In [117]:
df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])
df7_v = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]})

df8_v = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]})

In [112]:
#row based concat axis=0
pd.concat([df7,df8],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [113]:
pd.concat([df7_v,df8_v],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
0      101      NaN       NaN    123  yellow      12.0
1      103      NaN       NaN    214   green       9.0
2      104      NaN       NaN    663   green      44.0
3      105      NaN       NaN    331    blue      21.0

In [104]:
#column based concatination
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
0      NaN  yellow      101      12.0       NaN    123
1      NaN   green      103       9.0       NaN    214
2      NaN   green      104      44.0       NaN    663
3      NaN    blue      105      21.0       NaN    331

In [115]:
pd.concat([df7_v,df8_v],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
0      NaN  yellow      101      12.0       NaN    123
1      NaN   green      103       9.0       NaN    214
2      NaN   green      104      44.0       NaN    663
3      NaN    blue      105      21.0       NaN    331

In [114]:
#impact of disimar index value 
pd.concat([df7,df8],axis=1,sort=True)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [118]:
pd.concat([df7_v,df8_v],axis=1,sort=True)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

# Merge and Join

Merge combines dataframes using a column's values to identity common entries

Join combines dataframes using the index to identity common entries

In [122]:
pd.merge(df7,df8, how='outer', on='customer') #outer merge is union on 
#columns uness in on becomes _x and _y e.g. sales_x, sales_y

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [120]:
pd.merge(df7,df8, how='inner', on='customer') #inner merge is intersection of on i.e customers in both df

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [121]:
pd.merge(df7,df8, how='left', on='customer') #left merge all rows from df in left i.e. df7, all columns are included

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0

In [133]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                   'Q2': [201,202,203]},
                  index=['I0','I2','I3'])
df10 = pd.DataFrame({'Q3': [301,302,303],
                   'Q4': [401,402,403]},
                  index=['I0','I1','I3'])

In [134]:
#I1 is not in df9 so Nan comes when we join for df9 in I1 row
df9.join(df10,how='outer')

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1    NaN    NaN  302.0  402.0
I2  102.0  202.0    NaN    NaN
I3  103.0  203.0  303.0  403.0

# Pandas Functions

In [136]:
#basic functionalities of pandas
#unique functions
df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [137]:
#value_counts gives frequency for each value
df8['color'].value_counts()

green     2
yellow    1
blue      1
Name: color, dtype: int64

In [138]:
#mean mean of every column with numerical value
df9.mean()

Q1    102.0
Q2    202.0
dtype: float64

In [139]:
#columns for a df
df8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [140]:
df8

  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [142]:
# logical indexing
new_df=df8[(df8['customer']!='105') & (df8['color']!='green')]

In [143]:
new_df

  customer   color  distance  sales
4      101  yellow        12    123

In [145]:
print(df8['sales'].mean())
print(df8['distance'].min())

332.75
9

In [146]:
#define own function and apply that to all elements in the series
def profit(s):
    return s*0.5

In [147]:
#apply used for he same 
df8['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [154]:
# python function not built in pandas e.g. len
df8['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [156]:
#applymap only works in dataframes not series. Entry by entry not compelte series i.r. for aggregation function
df11=df8[['distance', 'sales']]
df11.applymap(profit)

   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [157]:
#witing aggregate funtion for a series
def col_sum(co):
    return sum(co)

df11.apply(col_sum)

distance      86
sales       1331
dtype: int64

In [158]:
del df8['color']
df8

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

In [159]:
df8.index

Int64Index([4, 5, 6, 7], dtype='int64')

In [160]:
df8.sort_values(by='distance')

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [161]:
df8

  customer  distance  sales
4      101        12    123
5      103         9    214
6      104        44    663
7      105        21    331

In [162]:
df8.sort_values(by='distance', inplace=True)

In [163]:
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [164]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

# groupby

## pivot table

In [166]:
grouped_data=df6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f908d2cbd90>

In [167]:
grouped_data.describe()

           product1                                           product2  \
              count mean       std  min   25%  50%   75%  max    count
customer
Customer 1      2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0
Customer2       2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0
Customer3       2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0


              mean         std    min      25%     50%      75%    max
customer
Customer 1    8.65    0.636396   8.20    8.425    8.65    8.875    9.1
Customer2     8.15    4.171930   5.20    6.675    8.15    9.625   11.1
Customer3   513.83  663.506577  44.66  279.245  513.83  748.415  983.0

In [168]:
grouped_data.mean()

            product1  product2
customer
Customer 1       1.6      8.65
Customer2        4.0      8.15
Customer3        6.2    513.83

In [170]:
grouped_data.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer2   0.282843    4.171930
Customer3   0.989949  663.506577

# saving a loading data frames

In [175]:
df8

  customer  distance  sales
5      103         9    214
4      101        12    123
7      105        21    331
6      104        44    663

In [171]:
df8.to_csv('df8.csv', index=True) # index = True means saves index in seperate columns

In [172]:
new_df8 = pd.read_csv('df8.csv',index_col=0)

In [173]:
new_df8

   customer  distance  sales
5       103         9    214
4       101        12    123
7       105        21    331
6       104        44    663

In [176]:
df8.to_excel('df8.xlsx', index=False, sheet_name='first sheet')

In [177]:
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet')
newer_df8

   customer  distance  sales
0       103         9    214
1       101        12    123
2       105        21    331
3       104        44    663

In [178]:
newer_df9 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=0)
newer_df9

          distance  sales
customer
103              9    214
101             12    123
105             21    331
104             44    663